
<details><summary>Terraform Plan Output</summary>

```Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infrastructure relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/infrastructure-for-event-driven-system/infrastructure-for-event-driven-system/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/infrastructure-for-event-driven-system/infrastructure-for-event-driven-system

To view this run in a browser, visit:
https://app.terraform.io/app/pablosspot/event-driven-system-infrastructure-main/runs/run-ojuY98kUKGiKnbHu

Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:ap-southeast-2:933392230433:certificate/f1a86996-91f3-4121-b955-2b95938ab0b9]
aws_elastic_beanstalk_application.eb_app: Refreshing state... [id=event-driven-app]
aws_sqs_queue.queue: Refreshing state... [id=https://sqs.ap-southeast-2.amazonaws.com/933392230433/event-driven-queue]
aws_s3_bucket.thumbnail_bucket: Refreshing state... [id=event-driven-thumbnail-bucket]
aws_s3_bucket.docker_run_bucket: Refreshing state... [id=docker-run-bucket]
aws_iam_role.ec2_role: Refreshing state... [id=event-driven-ec2-role]
aws_iam_instance_profile.ec2_eb_profile: Refreshing state... [id=event-driven-ec2-profile]
local_file.docker_run_config: Refreshing state... [id=dab02e7285505717a6f6b7a4b8844a5181ff3ff5]
aws_route53_record.validation_record["pablosspot.ml"]: Refreshing state... [id=Z08086882KIXUWHTYU1K1__a1d080dda80629adc3c60f9fd8bcf56c.pablosspot.ml._CNAME]
aws_route53_record.validation_record["*.pablosspot.ml"]: Refreshing state... [id=Z08086882KIXUWHTYU1K1__a1d080dda80629adc3c60f9fd8bcf56c.pablosspot.ml._CNAME]
aws_acm_certificate_validation.validation: Refreshing state... [id=2021-10-06 05:40:43 +0000 UTC]
aws_s3_bucket_policy.public_read: Refreshing state... [id=event-driven-thumbnail-bucket]
aws_s3_bucket_object.docker_run_object: Refreshing state... [id=bf6fdca5d0bc7691784362fdaa4de414ec108306220c950c4b0c47f56e5d057c.zip]
aws_elastic_beanstalk_application_version.eb_version: Refreshing state... [id=bf6fdca5d0bc7691784362fdaa4de414ec108306220c950c4b0c47f56e5d057c]
aws_elastic_beanstalk_environment.eb_env: Refreshing state... [id=e-gu2ejq6bkm]
aws_route53_record.endpoint: Refreshing state... [id=Z08086882KIXUWHTYU1K1_app_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # local_file.docker_run_config has been deleted
  - resource "local_file" "docker_run_config" {
      - content              = jsonencode(
            {
              - AWSEBDockerrunVersion = 2
              - containerDefinitions  = [
                  - {
                      - essential    = true
                      - image        = "933392230433.dkr.ecr.ap-southeast-2.amazonaws.com/backend:9072f38a"
                      - memory       = 128
                      - name         = "backend"
                      - portMappings = [
                          - {
                              - containerPort = 8000
                              - hostPort      = 80
                            },
                        ]
                    },
                  - {
                      - essential = true
                      - image     = "933392230433.dkr.ecr.ap-southeast-2.amazonaws.com/worker:9072f38a"
                      - memory    = 128
                      - name      = "worker"
                    },
                ]
            }
        ) -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0777" -> null
      - filename             = "./Dockerrun.aws.json" -> null
      - id                   = "dab02e7285505717a6f6b7a4b8844a5181ff3ff5" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.docker_run will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "docker_run"  {
      ~ id                  = "d25b420d2c28743c65f47222ff056df69ec7ecba" -> (known after apply)
      ~ output_base64sha256 = "nYhN5lB1tQfrXlmVAJHkDJRdNErLVR+EpTd85Ih+NLc=" -> (known after apply)
      ~ output_md5          = "0908b43cfcead07db5b3d00e59cde111" -> (known after apply)
      ~ output_sha          = "d25b420d2c28743c65f47222ff056df69ec7ecba" -> (known after apply)
      ~ output_size         = 351 -> (known after apply)
      ~ source_file         = "./Dockerrun.aws.json" -> "./docker-compose.yml"
        # (2 unchanged attributes hidden)
    }

  # aws_elastic_beanstalk_application_version.eb_version must be replaced
-/+ resource "aws_elastic_beanstalk_application_version" "eb_version" {
      ~ arn          = "arn:aws:elasticbeanstalk:ap-southeast-2:933392230433:applicationversion/event-driven-app/bf6fdca5d0bc7691784362fdaa4de414ec108306220c950c4b0c47f56e5d057c" -> (known after apply)
      ~ id           = "bf6fdca5d0bc7691784362fdaa4de414ec108306220c950c4b0c47f56e5d057c" -> (known after apply)
      ~ key          = "bf6fdca5d0bc7691784362fdaa4de414ec108306220c950c4b0c47f56e5d057c.zip" -> (known after apply) # forces replacement
      ~ name         = "bf6fdca5d0bc7691784362fdaa4de414ec108306220c950c4b0c47f56e5d057c" -> "2c0621a88e50573e712a8be1a74c6ac4810622c7ba49565fb67789f70daa88eb" # forces replacement
        tags         = {
            "created_by" = "terraform"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_elastic_beanstalk_environment.eb_env will be updated in-place
  ~ resource "aws_elastic_beanstalk_environment" "eb_env" {
        id                     = "e-gu2ejq6bkm"
        name                   = "event-driven-env"
        tags                   = {
            "created_by" = "terraform"
        }
      ~ version_label          = "bf6fdca5d0bc7691784362fdaa4de414ec108306220c950c4b0c47f56e5d057c" -> "2c0621a88e50573e712a8be1a74c6ac4810622c7ba49565fb67789f70daa88eb"
        # (17 unchanged attributes hidden)

      - setting {
          - name      = "AWS_DEFAULT_REGION" -> null
          - namespace = "aws:elasticbeanstalk:application:environment" -> null
          - value     = "ap-southeast-2" -> null
        }
      + setting {
          + name      = "AWS_DEFAULT_REGION"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "ap-southeast-2"
        }
      - setting {
          - name      = "BROKER_TYPE" -> null
          - namespace = "aws:elasticbeanstalk:application:environment" -> null
          - value     = "sqs" -> null
        }
      + setting {
          + name      = "BROKER_TYPE"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "sqs"
        }
      + setting {
          + name      = "DisableIMDSv1"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "true"
        }
      - setting {
          - name      = "ELBScheme" -> null
          - namespace = "aws:ec2:vpc" -> null
          - value     = "internet facing" -> null
        }
      + setting {
          + name      = "ELBScheme"
          + namespace = "aws:ec2:vpc"
          + value     = "internet facing"
        }
      - setting {
          - name      = "HealthCheckPath" -> null
          - namespace = "aws:elasticbeanstalk:environment:process:default" -> null
          - value     = "/docs" -> null
        }
      + setting {
          + name      = "HealthCheckPath"
          + namespace = "aws:elasticbeanstalk:environment:process:default"
          + value     = "/docs"
        }
      - setting {
          - name      = "IamInstanceProfile" -> null
          - namespace = "aws:autoscaling:launchconfiguration" -> null
          - value     = "event-driven-ec2-profile" -> null
        }
      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "event-driven-ec2-profile"
        }
      - setting {
          - name      = "InstanceType" -> null
          - namespace = "aws:autoscaling:launchconfiguration" -> null
          - value     = "t2.micro" -> null
        }
      + setting {
          + name      = "InstanceType"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "t2.micro"
        }
      - setting {
          - name      = "ListenerEnabled" -> null
          - namespace = "aws:elbv2:listener:default" -> null
          - value     = "false" -> null
        }
      + setting {
          + name      = "ListenerEnabled"
          + namespace = "aws:elbv2:listener:default"
          + value     = "false"
        }
      - setting {
          - name      = "LoadBalancerType" -> null
          - namespace = "aws:elasticbeanstalk:environment" -> null
          - value     = "application" -> null
        }
      + setting {
          + name      = "LoadBalancerType"
          + namespace = "aws:elasticbeanstalk:environment"
          + value     = "application"
        }
      - setting {
          - name      = "MatcherHTTPCode" -> null
          - namespace = "aws:elasticbeanstalk:environment:process:default" -> null
          - value     = "200" -> null
        }
      + setting {
          + name      = "MatcherHTTPCode"
          + namespace = "aws:elasticbeanstalk:environment:process:default"
          + value     = "200"
        }
      - setting {
          - name      = "MaxSize" -> null
          - namespace = "aws:autoscaling:asg" -> null
          - value     = "2" -> null
        }
      + setting {
          + name      = "MaxSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "2"
        }
      - setting {
          - name      = "MinInstancesInService" -> null
          - namespace = "aws:autoscaling:updatepolicy:rollingupdate" -> null
          - value     = "1" -> null
        }
      + setting {
          + name      = "MinInstancesInService"
          + namespace = "aws:autoscaling:updatepolicy:rollingupdate"
          + value     = "1"
        }
      - setting {
          - name      = "Protocol" -> null
          - namespace = "aws:elbv2:listener:443" -> null
          - value     = "HTTPS" -> null
        }
      + setting {
          + name      = "Protocol"
          + namespace = "aws:elbv2:listener:443"
          + value     = "HTTPS"
        }
      - setting {
          - name      = "QUEUE_NAME" -> null
          - namespace = "aws:elasticbeanstalk:application:environment" -> null
          - value     = "event-driven-queue" -> null
        }
      + setting {
          + name      = "QUEUE_NAME"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "event-driven-queue"
        }
      - setting {
          - name      = "S3_BUCKET_NAME" -> null
          - namespace = "aws:elasticbeanstalk:application:environment" -> null
          - value     = "event-driven-thumbnail-bucket" -> null
        }
      + setting {
          + name      = "S3_BUCKET_NAME"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "event-driven-thumbnail-bucket"
        }
      - setting {
          - name      = "SSLCertificateArns" -> null
          - namespace = "aws:elbv2:listener:443" -> null
          - value     = "arn:aws:acm:ap-southeast-2:933392230433:certificate/f1a86996-91f3-4121-b955-2b95938ab0b9" -> null
        }
      + setting {
          + name      = "SSLCertificateArns"
          + namespace = "aws:elbv2:listener:443"
          + value     = "arn:aws:acm:ap-southeast-2:933392230433:certificate/f1a86996-91f3-4121-b955-2b95938ab0b9"
        }
      - setting {
          - name      = "SSLPolicy" -> null
          - namespace = "aws:elbv2:listener:443" -> null
          - value     = "ELBSecurityPolicy-TLS-1-2-Ext-2018-06" -> null
        }
      + setting {
          + name      = "SSLPolicy"
          + namespace = "aws:elbv2:listener:443"
          + value     = "ELBSecurityPolicy-TLS-1-2-Ext-2018-06"
        }
      - setting {
          - name      = "StreamLogs" -> null
          - namespace = "aws:elasticbeanstalk:cloudwatch:logs" -> null
          - value     = "true" -> null
        }
      + setting {
          + name      = "StreamLogs"
          + namespace = "aws:elasticbeanstalk:cloudwatch:logs"
          + value     = "true"
        }
      - setting {
          - name      = "THUMBNAIL_BASE_URL" -> null
          - namespace = "aws:elasticbeanstalk:application:environment" -> null
          - value     = "https://event-driven-thumbnail-bucket.s3.ap-southeast-2.amazonaws.com/thumbnail" -> null
        }
      + setting {
          + name      = "THUMBNAIL_BASE_URL"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "https://event-driven-thumbnail-bucket.s3.ap-southeast-2.amazonaws.com/thumbnail"
        }
    }

  # aws_s3_bucket_object.docker_run_object must be replaced
-/+ resource "aws_s3_bucket_object" "docker_run_object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "0908b43cfcead07db5b3d00e59cde111" -> (known after apply)
      ~ id                     = "bf6fdca5d0bc7691784362fdaa4de414ec108306220c950c4b0c47f56e5d057c.zip" -> (known after apply)
      ~ key                    = "bf6fdca5d0bc7691784362fdaa4de414ec108306220c950c4b0c47f56e5d057c.zip" -> "2c0621a88e50573e712a8be1a74c6ac4810622c7ba49565fb67789f70daa88eb.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
        tags                   = {
            "created_by" = "terraform"
        }
      + version_id             = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # local_file.docker_run_config will be created
  + resource "local_file" "docker_run_config" {
      + content              = <<-EOT
            "services":
              "backend":
                "env_file":
                - ".env"
                "image": "933392230433.dkr.ecr.ap-southeast-2.amazonaws.com/backend:9072f38a"
                "ports":
                - "80:8000"
              "worker":
                "env_file":
                - ".env"
                "image": "933392230433.dkr.ecr.ap-southeast-2.amazonaws.com/worker:9072f38a"
            "version": "3.8"
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./docker-compose.yml"
      + id                   = (known after apply)
    }

Plan: 3 to add, 1 to change, 2 to destroy.

```

</details>
